//----------------------------------------------------------------------------------------------------
//подключаемые библиотеки
//----------------------------------------------------------------------------------------------------
#include "based.h"

//----------------------------------------------------------------------------------------------------
//константы
//----------------------------------------------------------------------------------------------------

//----------------------------------------------------------------------------------------------------
//глобальные переменные
//----------------------------------------------------------------------------------------------------

//****************************************************************************************************
//макроопределения
//****************************************************************************************************



//****************************************************************************************************
//порты обмена данными в режиме ведомого
//****************************************************************************************************

#define MISO_DDR      DDRB
#define MISO_PORT     PORTB
#define MISO_PIN      PINB
#define MISO          1

#define MOSI_DDR      DDRB
#define MOSI_PORT     PORTB
#define MOSI_PIN      PINB
#define MOSI          0

#define SCK_DDR      DDRB
#define SCK_PORT     PORTB
#define SCK_PIN      PINB
#define SCK          2

//----------------------------------------------------------------------------------------------------
//прототипы функций
//----------------------------------------------------------------------------------------------------
void InitAVR(void);//инициализация контроллера
void SendData(uint16_t value);//отправить данные
void MISO_Hi(void);//выставить высокий уровень на выходе MISO
void MISO_Lo(void);//выставить низкий уровень на выходе MISO
bool GetMOSIState(void);//получить значение уровня на входе MOSI
bool GetSCKState(void);//получить значение уровня на входе SCK

//----------------------------------------------------------------------------------------------------
//основная функция программы
//----------------------------------------------------------------------------------------------------
int main(void)
{ 
 InitAVR();
 _delay_ms(500);

 while(1)
 {
  int32_t v=0;
  for(int16_t n=0;n<32;n++)
  {
   //считываем показания АЦП 
   if (ADCSRA&(1<<ADIF)) ADCSRA^=(1<<ADIF);
   ADCSRA|=(1<<ADSC);//запускаем преобразование
   while((ADCSRA&(1<<ADSC)));//ждём завершения преобразования
   int32_t value;
   value=ADCL;  
   value|=(ADCH<<8); 
   v+=value;
  }
  uint16_t value=v>>5;
  //передаём
  SendData(value);  
 }

 return(0);
}
//****************************************************************************************************
//****************************************************************************************************
//общие функции
//****************************************************************************************************
//****************************************************************************************************

//----------------------------------------------------------------------------------------------------
//инициализация контроллера
//----------------------------------------------------------------------------------------------------
void InitAVR(void)
{
 cli();
 //настраиваем порты
 DDRB=0;
 
 MISO_DDR|=(1<<MISO);
 MOSI_DDR&=0xff^(1<<MOSI);
 SCK_DDR&=0xff^(1<<SCK);
 
 //задаём состояние портов
 PORTB=0x00;
 //настраиваем АЦП
  
 //включаем АЦП на всех каналах в режиме одиночного преобразования
 ADMUX=(1<<REFS2)|(1<<REFS1)|(0<<REFS0)|(0<<MUX3)|(0<<MUX2)|(1<<MUX1)|(1<<MUX0)|(0<<ADLAR);
 //REFS2-REFS0-выбор опорного напряжения (1,1,0=встроенный источник 2.56 В) 
 //MUX0-MUX3 - выбор входа (0011=PB3)
 //ADLAR -выравнивание преобразования (0=не нужно)
 ADCSRA=(1<<ADEN)|(0<<ADSC)|(0<<ADATE)|(0<<ADIF)|(0<<ADIE)|(0<<ADPS2)|(1<<ADPS1)|(1<<ADPS0);
 //ADEN-включение преобразования АЦП (1=включено)
 //ADSC-запуск преобразования (0=выключено)
 //ADATE-режим работы АЦП (0=одиночное преобразование)
 //ADIF-флаг прерывания от компаратора (0=выключено)
 //ADIE-разрешение прерываний от компаратора (0=выключено)
 //ADPS0-ADPS2-выбор частоты преобразования (011=делитель 8)
 ADCSRB=(0<<BIN)|(0<<ACME)|(0<<IPR)|(0<<ADTS2)|(0<<ADTS1)|(0<<ADTS0);
 //BIN-режим биполярного преобразования (1=включено)
 //ACME-разрешение мультиплексирования аналогового компаратора
 //IPR-бит изменения полярности (1=включено)
 //ADTS2-ADTS0 - источник автозапуска преобразования
  
 sei(); 
}

//----------------------------------------------------------------------------------------------------
//отправить данные
//----------------------------------------------------------------------------------------------------
void SendData(uint16_t value)
{ 
 //ждём перепада сигнала на входе SCK
 while(GetSCKState()==true); 
 //выставляем ноль
 MISO_Lo();
 while(GetSCKState()==false); 
 for(int16_t n=0;n<32;n++)
 {
  //ждём перепада сигнала на входе SCK
  while(GetSCKState()==true); 
  //выставляем единицу
  MISO_Hi();
  while(GetSCKState()==false);
 }
 //передаём данные
 uint16_t mask=(1<<0);
 for(int16_t n=0;n<sizeof(int16_t)*8;n++,mask<<=1)
 {
  //ждём перепада сигнала на входе SCK
  while(GetSCKState()==true);
  //выставляем значение
  if (value&mask) MISO_Hi();
             else MISO_Lo();
  while(GetSCKState()==false);
 }
 MISO_Lo();
}
//----------------------------------------------------------------------------------------------------
//выставить высокий уровень на выходе MISO
//----------------------------------------------------------------------------------------------------
void MISO_Hi(void)
{
 MISO_PORT|=(1<<MISO);
}
//----------------------------------------------------------------------------------------------------
//выставить низкий уровень на выходе MISO
//----------------------------------------------------------------------------------------------------
void MISO_Lo(void)
{
 MISO_PORT&=0xff^(1<<MISO);
}
//----------------------------------------------------------------------------------------------------
//получить значение уровня на входе MOSI
//----------------------------------------------------------------------------------------------------
bool GetMOSIState(void)
{
 if (MOSI_PIN&(1<<MOSI)) return(true);
 return(false);
}
//----------------------------------------------------------------------------------------------------
//получить значение уровня на входе SCK
//----------------------------------------------------------------------------------------------------
bool GetSCKState(void)
{
 if (SCK_PIN&(1<<SCK)) return(true);
 return(false);
}