#ifndef MT16S2D_H
#define MT16S2D_H

//----------------------------------------------------------------------------------------------------
//подключаемые библиотеки
//----------------------------------------------------------------------------------------------------
#include <stdint.h>
#include <stdbool.h>

//----------------------------------------------------------------------------------------------------
//протитипы функций
//----------------------------------------------------------------------------------------------------

void MT16S2D_Init(void);//инициализация дисплея
void MT16S2D_SetTextUpLine(char *text);//записать текст в верхнюю строчку экрана
void MT16S2D_SetTextDownLine(char *text);//записать текст в нижнюю строчку экрана
void MT16S2D_SetTextProgmemUpLine(const char *text);//записать текст из памяти в верхнюю строчку экрана
void MT16S2D_SetTextProgmemDownLine(const char *text);//записать текст из памяти в нижнюю строчку экрана

#endif